Ran Plan for project: `prod` dir: `opentofu` workspace: `prod`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

OpenTofu will perform the following actions:

  # module.cloudflare-dns.cloudflare_dns_record.dns_record will be created
+ resource "cloudflare_dns_record" "dns_record" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "postgres"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = "5ae741f7848ac60712586aebae55e6fb"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ hetzner_server_ip = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=opentoucan%252Finfrastructure-config%252Fopentofu%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```